 [
    {
      "Title": "Computerarchitektur und Betriebssysteme",
      "ID": 11,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Grundlegende Konzepte der Computerarchitektur, sofern sie zum Verständnis von Aufbau und Arbeitsweise von Betriebssystemen notwendig sind, sowie ausführliche Inhalte zu Aufbau und Arbeitsweise von Betriebssystemen.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
	  "DependandModules" : null,
	  "Credits" : 5
    },
    {
      "Title": "Einführung in die Informatik",
      "ID": 12,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Das Studienmodul beginnt mit einer Einführung in den Begriff der Informatik und, damit verbunden, von digitalen Rechenanlagen. Es folgt ein Kapitel über Modellierung. Hier werden mit Graphen, Entity - Relationship - Modellen und der Unified Modeling Language Ansätze zur Problemdarstellung und damit auch zu einer Problemlösung gegeben. Mit dem Begriff der Simulation wird ein zentrales Anliegen der Informatik vorgestellt.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
	  "DependandModules" : null,
	  "Credits" : 5
    },
    {
      "Title": "Grundlagen der Programmierung 1",
      "ID": 13,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Im Modul werden grundlegende Konzepte der objektorientierten Programmierung vermittelt und anhand geeigneter Programmieraufgaben geübt. Nach dem erfolgreichen Abschluss sind die Teilnehmenden befähigt, allein und in Zweierteams kleine bis mittlere Programmieraufgaben zu spezifizieren, zuentwerfen, zu implementieren, zu testen und zu dokumentieren.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
	  "DependandModules" : null,
	  "Credits" : 5
    },
    {
      "Title": "Kommunikation, Führung und Selbstmanagement",
      "ID": 14,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Im Modul wird Verhaltenskompetenz im Zusammenhang mit Reflexionsfähigkeit entwickelt. Persönlichkeitstests und die Vermittlung kommunikativerGrundlagen unterstützen die Selbstreflexion und das bewusste Auftreten in Präsentations-und Kommunikationssituationen.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Vortrag",
	  "DependandModules" : null,
	  "Credits" : 5
    },
    {
      "Title": "Lineare Algebra",
      "ID": 15,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Ziel des Kurses ist es, Grundkenntnisse der höheren Mathematik und hier insbesondere der Algebra zu vermitteln, die im Bereich der Medieninformatik Anwendung finden. Grundlegende Konzepte und Methoden der Logik, der Vektoralgebra und der linearen Algebra werden ausführlich beschrieben und den Lernenden durch zahlreiche Aufgaben sowie interaktive Animationen und Simulationen nahegebracht. Nach Durcharbeiten dieses Moduls sollten die Lernenden die präsentierten Konzepte und Methoden auf eine Weise beherrschen, dass sie Fragestellungen aus den genannten Problemkreisen selbständig lösen können.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
	  "DependandModules" : null,
	  "Credits" : 5
    },
    {
      "Title": "Mediendesign 1",
      "ID": 16,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Grundlagen von Gestaltung, Design, Wahrnehmung, Typografie und Farbgestaltung.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Vortrag",
	  "DependandModules" : null,
	  "Credits" : 5
    },
    {
      "Title": "Grundlagen der Programmierung 2",
      "ID": 21,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Im Modul werden fortgeschrittene Konzepte der objektorientierten Programmierung, beispielsweise Programmierung komplexer Datenstrukturen, graphischen Oberflächen  vermittelt und anhand geeigneter Programmieraufgaben geübt. Nach dem erfolgreichen Abschluss sind die Studierenden befähigt, allein und in Teams Programmieraufgaben zu spezifizieren, zu entwerfen, zu implementieren, zu testen, zu dokumentieren und umfangreiche Bibliotheken zu  benutzen.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
	  "DependandModules" : [13],
	  "Credits" : 5
    },
    {
      "Title": "Kommunikationsnetze 1",
      "ID": 22,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "In dem Modul werden Grundkenntnisse zu Kommunikationsnetzen vermittelt, wobei das ISO/OSI-Schichtenmodell als Grundlage dient. Der Schwerpunkt liegt auf lokalen Netzen sowie der Funktionsweise des Internet. Die Studierenden sollen anschließend in der Lage sein, eine Fragestellung mit Bezug zu Kommunikationsnetzen in die Schichten einzuordnen und so geeignete Lösungen zu finden.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
    "DependandModules" : null,
    "Credits" : 5
    },
    {
      "Title": "Mediendesign 2",
      "ID": 23,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Bildgestaltung und Webdesign, Grundlagen der  Fotografie und Bildbearbeitung.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Präsentation",
    "DependandModules" : [16],
    "Credits" : 5
    },
    {
      "Title": "Mensch-Computer-Kommunikation",
      "ID": 24,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Menschengerechte Gestaltung von Arbeit, Gestaltung von Bildschirmarbeitsplätzen, Gestaltungsgrundsätze für Dialoge, Normen und Gesetze.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
    "DependandModules" : null,
    "Credits" : 5
    },
    {
      "Title": "Relationen und Funktionen",
      "ID": 25,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Relationen und deren Eigenschaften, Darstellungsformen, reelle Analysis, Kurvendiskussionen und Differentialgleichungen.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
    "DependandModules" : [12, 15],
    "Credits" : 5
    },
    {
      "Title": "Theoretische Informatik",
      "ID": 26,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Einführung in grundlegende Modelle und Methoden der theoretischen Informatik. (Automatenmodelle, analysierende Konuepte bzw. generierende Konzepte) und formale Sprachen.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
    "DependandModules" : [12, 13, 15],
    "Credits" : 5
    },
    {
      "Title": "Algorithmen und Datenstrukturen",
      "ID": 31,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Einführung in Algorithmen (Darstellung, Analyse), Rekursion, Sortierung und dynamische Datenstrukturen sowie Hashverfahren.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
    "DependandModules" : [12, 13, 15],
    "Credits" : 5
    },
    {
      "Title": "Computergrafik 1",
      "ID": 32,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Soft- und Hardwarekomponenten der Computergrafik, Rastergrafiken, Transformationen, Kurven und Flächen, 3D Repräsentation von Objekten, Darstellung von Farben.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
    "DependandModules" : null,
    "Credits" : 5
    },
    {
      "Title": "Datenbanken",
      "ID": 33,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Das Ziel ist einerseits Datenbankkonzepte kennenzulernen und zu verstehen. Andererseits soll das praktische Verständnis für Datenbank-entwurf und Datenbankanfragen gewonnen werden. Anwendungsfälle und ein Online SQL Trainer sind im Studienmodul integriert.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
    "DependandModules" : [12],
    "Credits" : 5
    },
    {
      "Title": "IT-Recht",
      "ID": 34,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Das Modul beinhaltet eine praxisbezogene und anwendungsorientierte Darstellung des IT-und Computerrechts. Schwerpunkte sind hierbei das Medienrecht, das Urheberrecht und das Datenschutzrecht.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
    "DependandModules" : null,
    "Credits" : 5
    },
    {
      "Title": "Multimediatechnik",
      "ID": 35,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Physikalische und physiologische Grundlagen der Wahrnehmung von Schall und Licht, Digitalisierung von Daten, Audiotechnik Systeme, Vektor- und Rastergrafiken, Fernsehtechnik.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Klausur",
    "DependandModules" : [13, 21],
    "Credits" : 5
    },
    {
      "Title": "Web-Programmierung",
      "ID": 36,
      "IsFinished": false,
      "Grade": 0,
      "FurtherInfo": "Studenten lernen Web-Anwendungen und -Techniken kennen, programmieren Anwendungen im Internet und beherrschen Auszeichnungs-und Skriptsprachen.",
      "IsVisible": false,
      "IsCompulsory": true,
      "ExamType": "Hausarbeit",
    "DependandModules" : [12],
    "Credits" : 5
    }
  ]